## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.static_web_app["events"].azurerm_static_web_app.this has changed
  ~ resource "azurerm_static_web_app" "this" {
      + app_settings                       = {}
        id                                 = "/subscriptions/0766d027-cfc5-47ae-bd61-ebbc60fd1110/resourceGroups/rg-zenisu-events/providers/Microsoft.Web/staticSites/stapp-zenisu-events"
        name                               = "stapp-zenisu-events"
      + tags                               = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_static_web_app_custom_domain.static_web_app["events"] will be created
  + resource "azurerm_static_web_app_custom_domain" "static_web_app" {
      + domain_name       = "events.zeni-su.com"
      + id                = (known after apply)
      + static_web_app_id = (sensitive value)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

  # cloudflare_record.static_web_app["events"] will be created
  + resource "cloudflare_record" "static_web_app" {
      + allow_overwrite = false
      + content         = "orange-water-03430a803.1.azurestaticapps.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "events"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ecc59a79c63d0c89f8e64a5dfb41319a"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>